1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПеремещениеПаллета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПланированиеУпаковки</xr:Item>
				<xr:Item>InformationRegister.Лико_АдресноеХранение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРастарки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ПричиныРастарки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Содержимое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбылСоСклада</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыНаРастарку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЦепочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоИсходнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Управляющий</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Коробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Сотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Заказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_УпаковочныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаявкаНаСклад</Name>
					<Comment>Старая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерБобины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_КодПродукта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_ИнформацияОПродукте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_УпотребитьДо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_Roll_ID</Name>
					<Comment>Штрих-код EPSMA Roll ID короткий. (Правай часть от Roll Number)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_Товароместо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_РабочегоЦентра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ПриходРасходТовароместа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ТовароместоUID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаказаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Конверта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_СотрудникаПолныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ВходящихДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Растарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_КартаСнятияПерерасхода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ТипоразмерПаллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета2_0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ПричиныРастарки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ПричиныРастарки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереупаковкаОшибкаМаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереупаковкаПоврежденаУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереупаковкаБезПеремоткиПоЗаявкеМенеджера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремоткаПоЗаявкеМенеджера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйВК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплектацияПоЗаявкеМенеджераНаОтгрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыФормированияПаллет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыФормированияПаллет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переупаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСНеордерногоСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	//Найдем серию
	МассивСерий = Лико_Дополнительно.НайтиСерииПоШтрихкоду(ДанныеШтрихкода.Штрихкод);
	СерияНайдена = МассивСерий.Количество() > 0;
	Для каждого Серия из МассивСерий Цикл
		Если Объект.Содержимое.НайтиСтроки(Новый Структура("Серия", Серия)).Количество() = 0 Тогда
			НоваяСтрока = Объект.Содержимое.Добавить();
			НоваяСтрока.Серия = Серия;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Серия """ + Серия + """ уже добавлена в паллет.";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
		                                         
	Если НЕ СерияНайдена Тогда
		Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
		Если Результат.Ошибка <> "" Тогда
			Сообщить(Результат.Ошибка);
		Иначе
			Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Паллета") Тогда
				//Это паллет
				Объект.Паллет = Результат.Паллет;
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
				ПаллетПриИзменении(Неопределено);
			ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
				//Это физ. лицо
				Объект.АвторДокумента = Результат.Сотрудник;
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
			ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
				ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
				//Это ячейка
				Объект.ЯчейкаПолучатель = Результат.АдресаХранения;
				ЯчейкаПолучательПриИзмененииНаСервере();
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		РассчитатьКоличествоКоробок();
		ЗаполнитьТаблицуРастаркиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	УстановитьДоступностьЭлементов();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Объект.Паллет) Тогда
		Объект.РабочееМесто = ПараметрыСеанса.Лико_РабочееМесто;
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Площадка = Лико_Дополнительно.ПлощадкаПользователяПоУмолчанию(); 
		Объект.Организация = Объект.Площадка.Организация; 
		Объект.Подразделение = ТекущийПользователь.Подразделение;
		Параметры.Свойство("ФизЛицо", Объект.АвторДокумента);
	КонецЕсли;
	РассчитатьКоличествоКоробок();
	
	ДокументПроведенПриОткрытии = Объект.Проведен;
	
	Элементы.СодержимоеВыбылСоСклада.Видимость = РольДоступна("ПолныеПрава");
	
	Если Объект.ЗаказыНаРастарку.Количество() > 0 Тогда
		// Вызовем процедуру заполнения растарки, чтобы таблица правильно раскрасилась и расставились номера цепочек
		ЗаполнитьТаблицуРастаркиНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ПричинаРастарки) И ВРег(Лев(Строка(Объект.ПричинаРастарки), 17)) = ВРег("(не использовать)") Тогда
		Элементы.ПричинаРастарки.СписокВыбора.Добавить(Объект.ПричинаРастарки);
	КонецЕсли;
	
	РастаркаПоВерсии3 = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()) >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастаркиВерсия3.ЗначениеПараметра;
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ ДокументПроведенПриОткрытии
		И Объект.ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.СкладПолучатель, "ЯчейкаРастарка")
		//И Объект.ПричинаРастарки <> ПредопределенноеЗначение("Перечисление.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки")
		Тогда
		
		ДокументПроведенПриОткрытии = Истина;
		// Нужно вывести на печать накладную на передел
		Если РастаркаПоВерсии3 Тогда
			Обработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ПечатнаяФормаНакладнаяНаПеределЕРП_Версия3");
		Иначе	
			Обработка = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ВнешняяПечатнаяФормаНакладнаяНаПередел.ЗначениеПараметра");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Обработка) Тогда
			Сообщить("В системе не зарегистрирована печатная форма ""Накладная на передел""");
			Возврат;
		КонецЕсли;
		ИмяОбъекта = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Обработка.ИмяОбъекта", Обработка, "Обработка"); 
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
		ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения", ИмяОбъекта, МассивОбъектов));
		ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
		
		Если РастаркаПоВерсии3 Тогда
			Если НЕ (Объект.ПричинаРастарки = ПредопределенноеЗначение("Перечисление.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки") И Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.Ликофлекс")) Тогда 
				// Дополнительно выведем старую форму тоже
				Обработка = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ВнешняяПечатнаяФормаНакладнаяНаПередел.ЗначениеПараметра");
				Если НЕ ЗначениеЗаполнено(Обработка) Тогда
					Сообщить("В системе не зарегистрирована печатная форма ""Накладная на передел""");
					Возврат;
				КонецЕсли;
				ИмяОбъекта = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Обработка.ИмяОбъекта", Обработка, "Обработка"); 
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(Объект.Ссылка);
				ПараметрыОткрытия = Новый Структура;
				ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
				ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения", ИмяОбъекта, МассивОбъектов));
				ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
				ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
			КонецЕсли;
			ОтправитьПисьмоОбОшибкеМаркировки();
		КонецЕсли;
	КонецЕсли;
	РассчитатьКоличествоКоробок();
	ЗаполнитьТаблицуРастаркиНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоОбОшибкеМаркировки()
	
	Если Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки Тогда
		АдресДляОтправкиПисем = Лико_Дополнительно.НайтиЭлектронныйАдресОтветственногоПоСкладу(Объект.СкладОтправитель, "лк Адрес для отправки писем о растарке с причиной Ошибка маркировки");
		Если ЗначениеЗаполнено(АдресДляОтправкиПисем) Тогда
			// Напишем письмо ответственному
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ПечатнаяФормаНакладнаяНаПеределЕРП_Версия3");
			Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
				Сообщить("В справочнике предопределенных значений не найдена ""ПечатнаяФормаНакладнаяНаПеределЕРП_Версия3""");
				Возврат;
			КонецЕсли;
			ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			ВнешняяОбработкаПлан = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
			
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(Объект.Ссылка);
			ТабДок = ВнешняяОбработкаПлан.СформироватьПечатнуюФорму(МассивОбъектов, Неопределено, Неопределено);
			Попытка
				УдалитьФайлы(ИмяФайла);
			Исключение
			КонецПопытки;
			
			Если ТабДок <> Неопределено Тогда
				Тема = "Ошибка маркировки " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yy");
				ИмяФайла = КаталогВременныхФайлов() + Тема + ".xlsx";
				ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
				
				Текст = "";
				Лико_Планирование.ОтправитьПисьмо(Текст, Тема, АдресДляОтправкиПисем,,,,, ИмяФайла);
				
				Попытка
					УдалитьФайлы(ИмяФайла);
				Исключение
				КонецПопытки;
			Иначе
				ИмяФайла = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПолучательПриИзменении(Элемент)
	ЯчейкаПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЯчейкаПолучательПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ЯчейкаПолучатель) Тогда
		Объект.СкладПолучатель = Объект.ЯчейкаПолучатель.Владелец;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	
	Если Элементы.СтраницаРастарка.Видимость Тогда
		ЗаполнитьТаблицуРастаркиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.СкладПолучатель.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ЯчейкаПолучатель);
	// Видно только если ячейка-получатель = ячейка-растарка
	Элементы.ПричинаРастарки.Видимость = Объект.ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.СкладПолучатель, "ЯчейкаРастарка");
	//Элементы.СтраницаРастарка.Видимость = Элементы.ПричинаРастарки.Видимость И РольДоступна("ПолныеПрава") И ДоступКИзменениюТаблицыРастаркиВЗависимостиОтПричины(Объект.ПричинаРастарки);
	Элементы.СтраницаРастарка.Видимость = Элементы.ПричинаРастарки.Видимость И ДоступКИзменениюТаблицыРастаркиВЗависимостиОтПричины(Объект.ПричинаРастарки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПаллетПриИзменении(Элемент)
	ПаллетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПаллетПриИзмененииНаСервере()
	
	ОбъектДокумент = РеквизитФормыВЗначение("Объект");
	ОбъектДокумент.ПаллетПриИзменении();
	ЗначениеВРеквизитФормы(ОбъектДокумент, "Объект");
	РассчитатьКоличествоКоробок();
	Если Элементы.СтраницаРастарка.Видимость Тогда
		ЗаполнитьТаблицуРастаркиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураПоШтрихкоду(ПараметрыОбработки, КэшированныеЗначения)
	
	Возврат ШтрихкодированиеНоменклатурыСервер.НоменклатураПоШтрихкоду(ПараметрыОбработки, КэшированныеЗначения); 
	
КонецФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСерииПоПаллету(Команда)
	ПаллетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	Объект.ЯчейкаПолучатель = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	Объект.ЯчейкаОтправитель = Неопределено;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СодержимоеПриИзменении(Элемент)
	РассчитатьКоличествоКоробок();
	ЗаполнитьТаблицуРастаркиНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоКоробок()
	
	КоличествоКоробок = Лико_Дополнительно.РассчитатьКоличествоКоробокВТЗ(Объект.Содержимое.Выгрузить(, "Серия"));
	Элементы.СтраницаТовары.Заголовок = "Товары (" + Объект.Содержимое.Количество() + ")";

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	РассчитатьКоличествоКоробок();
	ЗаполнитьТаблицуРастаркиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.Прочее
		И НЕ ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Отказ = Истина;
		Сообщить("Для причины растарки ""Прочее"" необходимо указать комментарий");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки
		И НЕ ЗначениеЗаполнено(Объект.Комментарий)
		И (Объект.Площадка = Справочники.Лико_Площадки.Ликофлекс
			ИЛИ Объект.Площадка = Справочники.Лико_Площадки.Линкс)
		И Объект.Дата >= Дата(2025,03,05,16,00,00) Тогда
		Отказ = Истина;
		Сообщить("Для причины растарки """ + Объект.ПричинаРастарки  + """ необходимо указать комментарий");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуРастарки(Команда)
	ЗаполнитьТаблицуРастаркиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРастаркиНаСервере()

	ОбъектДокумент = РеквизитФормыВЗначение("Объект");
	ОбъектДокумент.ЗаполнитьТаблицуРастарки();
	ЗначениеВРеквизитФормы(ОбъектДокумент, "Объект");
	
	ТекущийИдентификаторСвязи = Неопределено;
	ТекущийНомерСтрокиДляЦвета = 1;
	НомерЦепочки = 0;
	Для каждого Строка из Объект.ЗаказыНаРастарку Цикл
		Если ТекущийИдентификаторСвязи = Неопределено ИЛИ ТекущийИдентификаторСвязи <> Строка.ИдентификаторСвязи Тогда
			ТекущийНомерСтрокиДляЦвета = НЕ ТекущийНомерСтрокиДляЦвета;
			НомерЦепочки = НомерЦепочки + 1;
		КонецЕсли;
		Строка.НомерСтрокиДляЦвета = ТекущийНомерСтрокиДляЦвета;
		Строка.НомерЦепочки = НомерЦепочки;
		ТекущийИдентификаторСвязи = Строка.ИдентификаторСвязи;
	КонецЦикла;
		
	//Если НЕ ЗначениеЗаполнено(Объект.ЯчейкаПолучатель) ИЛИ НЕ ЗначениеЗаполнено(Объект.СкладПолучатель) ИЛИ Объект.ЯчейкаПолучатель <> Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.СкладПолучатель, "ЯчейкаРастарка") Тогда
	//	Объект.ЗаказыНаРастарку.Очистить();
	//	Возврат;
	//КонецЕсли;
	//	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВЫРАЗИТЬ(Т.НомерСтроки КАК ЧИСЛО(10, 0)) КАК НомерСтроки,
	//	|	ВЫРАЗИТЬ(Т.Серия КАК Справочник.СерииНоменклатуры) КАК Серия
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	&ТаблицаСерий КАК Т
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ИСТИНА КАК ЭтоИсходнаяСтрока,
	//	|	СерииНоменклатуры.Лико_ХарактеристикаВладелец КАК Характеристика,
	//	|	СерииНоменклатуры.Лико_НаправлениеНамотки КАК Намотка,
	//	|	СерииНоменклатуры.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
	//	|	СерииНоменклатуры.Лико_ЧестныйЗнак КАК ЧестныйЗнак,
	//	|	СерииНоменклатуры.Лико_НомерПоставки КАК НомерПоставки,
	//	|	СерииНоменклатуры.Лико_Город КАК Город,
	//	|	СУММА(СерииНоменклатуры.Лико_КоличествоВУпаковке) КАК Количество,
	//	|	МИНИМУМ(ВТ.НомерСтроки) КАК НомерСтроки,
	//	|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура).Наименование КАК НоменклатураНаименование,
	//	|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Наименование КАК ХарактеристикаНаименование
	//	|ИЗ
	//	|	ВТ КАК ВТ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	//	|		ПО ВТ.Серия = СерииНоменклатуры.Ссылка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	СерииНоменклатуры.Лико_ХарактеристикаВладелец,
	//	|	СерииНоменклатуры.Лико_НаправлениеНамотки,
	//	|	СерииНоменклатуры.Лико_КодЭтикеткиЗаказчика,
	//	|	СерииНоменклатуры.Лико_ЧестныйЗнак,
	//	|	СерииНоменклатуры.Лико_НомерПоставки,
	//	|	СерииНоменклатуры.Лико_Город,
	//	|	ВЫРАЗИТЬ(СерииНоменклатуры.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура).Наименование,
	//	|	СерииНоменклатуры.Лико_ХарактеристикаВладелец.Наименование
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НоменклатураНаименование,
	//	|	ХарактеристикаНаименование,
	//	|	НомерСтроки";
	//
	//Запрос.УстановитьПараметр("ТаблицаСерий", Объект.Содержимое.Выгрузить(,"Серия,НомерСтроки"));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//РезультатТаблица = РезультатЗапроса.Выгрузить();
	//
	//МассивСтрокКУдалению = Новый Массив;
	//СтрокаНекопируемыхСвойств = "НомерСтроки,ЭтоИсходнаяСтрока";
	//СтрокаСтрокДляОтбора = "ЭтоИсходнаяСтрока,Характеристика,Намотка,КодЭтикеткиЗаказчика,ЧестныйЗнак,НомерПоставки,Город";
	//
	//Для каждого СтрокаТЧ из Объект.ЗаказыНаРастарку Цикл
	//	Если СтрокаТЧ.ЭтоИсходнаяСтрока Тогда
	//		СтруктураОтбора = Новый Структура(СтрокаСтрокДляОтбора);
	//		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
	//		НайденныеСтроки = РезультатТаблица.НайтиСтроки(СтруктураОтбора);
	//		Если НайденныеСтроки.Количество() = 0 Тогда
	//			// В выборке нет такой строки, нужно удалить
	//			НайденныеСтрокиПоИдентификатору = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ИдентификаторСвязи", СтрокаТЧ.ИдентификаторСвязи));
	//			Для каждого НайденнаяСтрокаПоИдентификатору из НайденныеСтрокиПоИдентификатору Цикл
	//				МассивСтрокКУдалению.Добавить(НайденнаяСтрокаПоИдентификатору);
	//			КонецЦикла;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для каждого Строка из РезультатТаблица Цикл
	//	// Попробуем найти такую строку
	//	СтруктураОтбора = Новый Структура(СтрокаСтрокДляОтбора);
	//	ЗаполнитьЗначенияСвойств(СтруктураОтбора, Строка);
	//	НайденныеИсходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(СтруктураОтбора);
	//	Если НайденныеИсходныеСтроки.Количество() > 0 Тогда
	//		НайденнаяИсходнаяСтрока = НайденныеИсходныеСтроки[0];
	//		Если НайденнаяИсходнаяСтрока.Количество = Строка.Количество Тогда
	//			// Строка совпадает, ничего делать не нужно
	//			Продолжить;
	//		Иначе
	//			// Количество не совпадает, поменяем количество и перезаполним НЕисходные строки
	//			НайденнаяИсходнаяСтрока.Количество = Строка.Количество;
	//			НайденныеНЕисходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ЭтоИсходнаяСтрока,ИдентификаторСвязи", Ложь, НайденнаяИсходнаяСтрока.ИдентификаторСвязи));
	//			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрокКУдалению, НайденныеНЕисходныеСтроки, Истина);
	//			Если НайденнаяИсходнаяСтрока.НомерСтроки = Объект.ЗаказыНаРастарку.Количество() Тогда
	//				// Добавим в конец
	//				НоваяСтрока = Объект.ЗаказыНаРастарку.Добавить();
	//			Иначе
	//				// Вставим после текущей строки
	//				НоваяСтрока = Объект.ЗаказыНаРастарку.Вставить(НайденнаяИсходнаяСтрока.НомерСтроки);
	//			КонецЕсли;
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяИсходнаяСтрока,,СтрокаНекопируемыхСвойств);
	//		КонецЕсли;
	//	Иначе
	//		// Такая строка не найдена, добавим 2 новые (исходную и НЕисходную)
	//		НоваяСтрокаИсходная = Объект.ЗаказыНаРастарку.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрокаИсходная, Строка);
	//		НоваяСтрокаИсходная.ЭтоИсходнаяСтрока = Истина;
	//		НоваяСтрокаИсходная.ИдентификаторСвязи = Строка(Новый УникальныйИдентификатор);
	//		
	//		НоваяСтрокаНЕисходная = Объект.ЗаказыНаРастарку.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрокаНЕисходная, НоваяСтрокаИсходная,,СтрокаНекопируемыхСвойств);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для каждого Строка из МассивСтрокКУдалению Цикл
	//	Объект.ЗаказыНаРастарку.Удалить(Строка);
	//КонецЦикла;
	//
	//ТекущийИдентификаторСвязи = Неопределено;
	//ТекущийНомерСтрокиДляЦвета = 1;
	//НомерЦепочки = 0;
	//Для каждого Строка из Объект.ЗаказыНаРастарку Цикл
	//	Если ТекущийИдентификаторСвязи = Неопределено ИЛИ ТекущийИдентификаторСвязи <> Строка.ИдентификаторСвязи Тогда
	//		ТекущийНомерСтрокиДляЦвета = НЕ ТекущийНомерСтрокиДляЦвета;
	//		НомерЦепочки = НомерЦепочки + 1;
	//	КонецЕсли;
	//	Строка.НомерСтрокиДляЦвета = ТекущийНомерСтрокиДляЦвета;
	//	Строка.НомерЦепочки = НомерЦепочки;
	//	ТекущийИдентификаторСвязи = Строка.ИдентификаторСвязи;
	//КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаРастаркуКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЗаказыНаРастарку.ТекущиеДанные;
	// Найдем исходную строку
	ИсходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ИдентификаторСвязи,ЭтоИсходнаяСтрока", ТекущаяСтрока.ИдентификаторСвязи, Истина));
	Если ИсходныеСтроки.Количество() <> 1 Тогда
		Сообщить("Ошибка: найдено " + ИсходныеСтроки.Количество() + " исходных строк");
		Возврат;
	КонецЕсли;
	ИсходнаяСтрока = ИсходныеСтроки[0];
	// Найдем НЕ исходные строки
	НеИсходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ИдентификаторСвязи,ЭтоИсходнаяСтрока", ТекущаяСтрока.ИдентификаторСвязи, Ложь));
	КоличествоВНеИсходныхСтроках = 0;
	МаксимальныйНомерСтроки = 0;
	Для каждого Строка из НеИсходныеСтроки Цикл
		КоличествоВНеИсходныхСтроках = КоличествоВНеИсходныхСтроках + Строка.Количество;
		МаксимальныйНомерСтроки = Макс(МаксимальныйНомерСтроки, Строка.НомерСтроки);
	КонецЦикла;
	
	Если КоличествоВНеИсходныхСтроках < ИсходнаяСтрока.Количество Тогда
		// Нужно добавить новую строку в конец текущей связки строк
		НоваяСтрока = Объект.ЗаказыНаРастарку.Вставить(МаксимальныйНомерСтроки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока,, "НомерСтроки,ЭтоИсходнаяСтрока");
		НоваяСтрока.Количество = ИсходнаяСтрока.Количество - КоличествоВНеИсходныхСтроках;
		Если НоваяСтрока.Количество <= 0.1 Тогда
			ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("ОтветилиНаВопросОбОстаткеЭтикеток", ЭтотОбъект, Новый Структура("ИдСтроки", НоваяСтрока.ПолучитьИдентификатор()));
			ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, "Осталось " + НоваяСтрока.Количество * 1000 + " шт. этикеток. Необходимо их упаковать?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		Иначе
			Сообщить("Вы ввели меньшее количество, чем передали на растарку. Добавлена новая строка на оставшееся количество (" + НоваяСтрока.Количество + " тыс.шт.)");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветилиНаВопросОбОстаткеЭтикеток(Ответ, ДопПараметры) Экспорт
	
	Строка = Объект.ЗаказыНаРастарку.НайтиПоИдентификатору(ДопПараметры.ИдСтроки);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Строка.Примечание = "Не выбрасывать, упаковать в отдельную коробку";
	Иначе
		Строка.Примечание = "Можно утилизировать";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаРастаркуПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ЗаказыНаРастарку.ТекущиеДанные;
	Элементы.ЗаказыНаРастаркуКонтекстноеМенюГруппаДляНеИсходныхСтрок.Видимость = ТекущаяСтрока <> Неопределено И НЕ ТекущаяСтрока.ЭтоИсходнаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаРастаркуПередУдалением(Элемент, Отказ)
	
	Если НЕ ПолныеПрава Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ЗаказыНаРастарку.ТекущиеДанные;
	НеИсходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ИдентификаторСвязи,ЭтоИсходнаяСтрока", ТекущаяСтрока.ИдентификаторСвязи, Ложь));
	Если НеИсходныеСтроки.Количество() = 1 Тогда
		Отказ = Истина;
		Сообщить("Вы пытаетесь удалить единственную строку, которая должна получиться после растарки. Удаление единственной строки невозможно");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаРастаркуХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	а=0;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаРастаркуХарактеристикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	а=0;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаРастаркуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущаяСтрока = Элементы.ЗаказыНаРастарку.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено ИЛИ ТекущаяСтрока.ЭтоИсходнаяСтрока Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ДоступКИзменениюТаблицыРастаркиВЗависимостиОтПричины(Объект.ПричинаРастарки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ЗаказыНаРастаркуХарактеристика" Тогда
		СтандартнаяОбработка = Ложь;
		// Найдем исходную строку
		ИсходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ИдентификаторСвязи,ЭтоИсходнаяСтрока", ТекущаяСтрока.ИдентификаторСвязи, Истина));
		Если ИсходныеСтроки.Количество() <> 1 Тогда
			Сообщить("Ошибка: найдено " + ИсходныеСтроки.Количество() + " исходных строк");
			Возврат;
		КонецЕсли;
		//фиксНастройки = Новый НастройкиКомпоновкиДанных;
		////эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		////эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
		////эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		////Характеристика = ИсходныеСтроки[0].Характеристика;
		////Партнер = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Характеристика.Лико_ЗаказНоменклатуры.Партнер", Характеристика, "Характеристика");
		////эОтбор.ПравоеЗначение = Партнер;
		////эОтбор.Использование = Истина;
		//
		//ПараметрыОтбора = Новый Структура;    
		//ПараметрыОтбора.Вставить("ФиксированныеНастройки", фиксНастройки);
		//ПараметрыОтбора.Вставить("РежимВыбора", Истина);
		//
		//ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора", ПараметрыОтбора,,,,, Новый ОписаниеОповещения("РастаркаВыбранЗаказКлиента", ЭтотОбъект, Новый Структура("ИдСтроки", Элементы.ЗаказыНаРастарку.ТекущаяСтрока)));
		
		ПоказатьВводСтроки(Новый ОписаниеОповещения("РастаркаВыбранЗаказКлиента", ЭтотОбъект, Новый Структура("ИдСтроки", Элементы.ЗаказыНаРастарку.ТекущаяСтрока)),, "Введите номер заказа", 7, Ложь);
		
	ИначеЕсли Поле.Имя = "ЗаказыНаРастаркуХарактеристикаВладелец" Тогда
		СтандартнаяОбработка = Ложь;
		//// Найдем исходную строку
		//ИсходныеСтроки = Объект.ЗаказыНаРастарку.НайтиСтроки(Новый Структура("ИдентификаторСвязи,ЭтоИсходнаяСтрока", Элементы.ЗаказыНаРастарку.ТекущиеДанные.ИдентификаторСвязи, Истина));
		//Если ИсходныеСтроки.Количество() <> 1 Тогда
		//	Сообщить("Ошибка: найдено " + ИсходныеСтроки.Количество() + " исходных строк");
		//	Возврат;
		//КонецЕсли;
		//Характеристика = ИсходныеСтроки[0].Характеристика;
		Заказ = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Характеристика.Лико_ЗаказНоменклатуры", Элементы.ЗаказыНаРастарку.ТекущиеДанные.Характеристика, "Характеристика");
		// Нужно выбрать номенклатуру
		ДопПараметры = Новый Структура("Заказ,ИдСтроки", Заказ, Элементы.ЗаказыНаРастарку.ТекущаяСтрока);
		ОткрытьФорму("Документ.Лико_ПеремещениеПаллета.Форма.ФормаВыбраНоменклатуры", ДопПараметры, ЭтаФорма, Новый УникальныйИдентификатор,,, Новый ОписаниеОповещения("РастаркаВыбранаНоменклатура", ЭтотОбъект, ДопПараметры), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступКИзменениюТаблицыРастаркиВЗависимостиОтПричины(Причина)
	
	Возврат Причина = Перечисления.Лико_ПричиныРастарки.ПеремоткаПоЗаявкеМенеджера ИЛИ Причина = Перечисления.Лико_ПричиныРастарки.ПереупаковкаБезПеремоткиПоЗаявкеМенеджера;
	
КонецФункции

&НаКлиенте
Процедура РастаркаВыбранЗаказКлиента(НомерЗаказа, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НомерЗаказа) Тогда
		//Сообщить("Заказ не выбран");
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;
	
	Заказ = Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказа, "ЗаказКлиента");
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Сообщить("Не найден заказ с номером " + НомерЗаказа);
		Возврат;
	КонецЕсли;
	
	// Нужно выбрать номенклатуру
	ДопПараметры.Вставить("Заказ", Заказ);
	ОткрытьФорму("Документ.Лико_ПеремещениеПаллета.Форма.ФормаВыбраНоменклатуры", ДопПараметры, ЭтаФорма, Новый УникальныйИдентификатор,,, Новый ОписаниеОповещения("РастаркаВыбранаНоменклатура", ЭтотОбъект, ДопПараметры), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РастаркаВыбранаНоменклатура(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеЗначение.Характеристика) Тогда
		//Сообщить("Номенклатура не выбрана");
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущаяСтрока = Объект.ЗаказыНаРастарку.НайтиПоИдентификатору(ДопПараметры.ИдСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Ошибка: не удалось найти строку, для которой производился выбор заказа и номенклатуры");
		Возврат;
	КОнецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ВыбранноеЗначение,, "Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаРастаркуНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПричинаРастаркиПриИзмененииНаСервере()
	
	Если Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.КомплектацияПоЗаявкеМенеджераНаОтгрузку
		ИЛИ Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки
		ИЛИ Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаПоврежденаУпаковка
		ИЛИ Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПовторныйВК Тогда
		Объект.ЗаказыНаРастарку.Очистить();
	КонецЕсли;
	
	ЗаполнитьТаблицуРастаркиНаСервере();
	
	УстановитьДоступностьЭлементов();
	
	Если Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПереупаковкаБезПеремоткиПоЗаявкеМенеджера
		ИЛИ Объект.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.ПеремоткаПоЗаявкеМенеджера Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРастарка;
		ЗаполнитьПримечанияНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПричинаРастаркиПриИзменении(Элемент)
	ПричинаРастаркиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
		Сообщить("Заполните автора документа");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.Содержимое.Количество() > 0 И НЕ ЗначениеЗаполнено(Объект.Паллет) Тогда
		// Паллет не считан. Спросим, нужно ли создать новый паллет
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросОНеобходимостиСоздаватьПаллет", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Вы не считали ШК паллета, но считали коробки. Создать паллет автоматически?", РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Отмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОНеобходимостиСоздаватьПаллет(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СоздатьФормированиеПаллетаПереупаковка();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьФормированиеПаллетаПереупаковка()
	
	Если НЕ ЗначениеЗаполнено(Объект.ЯчейкаПолучатель) Тогда
		Сообщить("Заполните ячейку-получатель");
		Возврат;
	КонецЕсли;
	
	НовыйДокумент = Документы.Лико_ФормированиеПаллета.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, Объект, "АвторДокумента,РабочееМесто,Организация,Подразделение,Площадка");
	НовыйДокумент.ЯчейкаПолучатель = Объект.ЯчейкаПолучатель;
	НовыйДокумент.Комментарий = "Создан автоматически из перемещения паллета";
	НовыйДокумент.Паллет = Лико_Дополнительно.СоздатьНовыйПаллет(НовыйДокумент.АвторДокумента);
	НовыйДокумент.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.Переупаковка;
	НовыйДокумент.Дата = ?(НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДата()), Объект.Дата-1, ТекущаяДата());
	НовыйДокумент.ДатаФормирования = НовыйДокумент.Дата;
	Для каждого Строка из Объект.Содержимое Цикл
		ЗаполнитьЗначенияСвойств(НовыйДокумент.Содержимое.Добавить(), Строка);
	КонецЦикла;
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Объект.Паллет = НовыйДокумент.Паллет;
		ПаллетПриИзмененииНаСервере();
		Сообщить("Создан документ """ + НовыйДокумент.Ссылка + """");
	Исключение
		Сообщить("Не удалось создать формирование паллета: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПримечания(Команда)
	ЗаполнитьПримечанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПримечанияНаСервере()
	
    УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаРастарки = Объект.ЗаказыНаРастарку.Выгрузить(Новый Структура("ЭтоИсходнаяСтрока", Ложь));
	Если ТаблицаРастарки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаРастарки.НомерСтроки КАК ЧИСЛО(10, 0)) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(ТаблицаРастарки.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВЫРАЗИТЬ(ТаблицаРастарки.Намотка КАК Справочник.Лико_Намотка) КАК Намотка,
		|	ВЫРАЗИТЬ(ТаблицаРастарки.КодЭтикеткиЗаказчика КАК СТРОКА(40)) КАК КодЭтикеткиЗаказчика,
		|	ВЫРАЗИТЬ(ТаблицаРастарки.НомерПоставки КАК Справочник.Лико_НомераПоставок) КАК НомерПоставки,
		|	ВЫРАЗИТЬ(ТаблицаРастарки.Город КАК СТРОКА(100)) КАК Город,
		|	ВЫРАЗИТЬ(ТаблицаРастарки.ЧестныйЗнак КАК Справочник.Лико_ЧестныйЗнак) КАК ЧестныйЗнак
		|ПОМЕСТИТЬ ВТ_ТаблицаРастарки
		|ИЗ
		|	&ТаблицаРастарки КАК ТаблицаРастарки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаРастарки.НомерСтроки КАК НомерСтроки,
		|	ВТ_ТаблицаРастарки.Характеристика КАК Характеристика,
		|	ВТ_ТаблицаРастарки.Намотка КАК Намотка,
		|	ВТ_ТаблицаРастарки.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		|	ВТ_ТаблицаРастарки.НомерПоставки КАК НомерПоставки,
		|	ВТ_ТаблицаРастарки.Город КАК Город,
		|	ВТ_ТаблицаРастарки.ЧестныйЗнак КАК ЧестныйЗнак,
		|	МАКСИМУМ(Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Дата) КАК ДатаПоследнейЗаявкиНаОтгрузку
		|ПОМЕСТИТЬ ВТ_СДатойПоследнейЗаявки
		|ИЗ
		|	ВТ_ТаблицаРастарки КАК ВТ_ТаблицаРастарки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ЗаявкаНаОтгрузку.Товары КАК Лико_ЗаявкаНаОтгрузкуТовары
		|		ПО ВТ_ТаблицаРастарки.Характеристика = Лико_ЗаявкаНаОтгрузкуТовары.Характеристика
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_ТаблицаРастарки.Намотка = Лико_ЗаявкаНаОтгрузкуТовары.Намотка
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_ТаблицаРастарки.КодЭтикеткиЗаказчика = Лико_ЗаявкаНаОтгрузкуТовары.КодЭтикеткиЗаказчика
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_ТаблицаРастарки.НомерПоставки = Лико_ЗаявкаНаОтгрузкуТовары.НомерПоставки
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_ТаблицаРастарки.Город = Лико_ЗаявкаНаОтгрузкуТовары.Город
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_ТаблицаРастарки.ЧестныйЗнак = Лико_ЗаявкаНаОтгрузкуТовары.ЧестныйЗнак
		|			КОНЕЦ)
		|			И (Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Дата <= &ДатаРастарки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицаРастарки.НомерСтроки,
		|	ВТ_ТаблицаРастарки.Характеристика,
		|	ВТ_ТаблицаРастарки.Намотка,
		|	ВТ_ТаблицаРастарки.КодЭтикеткиЗаказчика,
		|	ВТ_ТаблицаРастарки.НомерПоставки,
		|	ВТ_ТаблицаРастарки.Город,
		|	ВТ_ТаблицаРастарки.ЧестныйЗнак
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СДатойПоследнейЗаявки.НомерСтроки КАК НомерСтроки,
		|	ВТ_СДатойПоследнейЗаявки.Характеристика КАК Характеристика,
		|	ВТ_СДатойПоследнейЗаявки.Намотка КАК Намотка,
		|	ВТ_СДатойПоследнейЗаявки.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		|	ВТ_СДатойПоследнейЗаявки.НомерПоставки КАК НомерПоставки,
		|	ВТ_СДатойПоследнейЗаявки.Город КАК Город,
		|	ВТ_СДатойПоследнейЗаявки.ЧестныйЗнак КАК ЧестныйЗнак,
		|	ВТ_СДатойПоследнейЗаявки.ДатаПоследнейЗаявкиНаОтгрузку КАК ДатаПоследнейЗаявкиНаОтгрузку,
		|	МАКСИМУМ(ВЫРАЗИТЬ(Лико_ЗаявкаНаОтгрузкуТовары.Примечание КАК СТРОКА(1000))) КАК Примечание,
		|	МАКСИМУМ(Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Номер) КАК НомерЗаявкиНаОтгрузку
		|ИЗ
		|	ВТ_СДатойПоследнейЗаявки КАК ВТ_СДатойПоследнейЗаявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ЗаявкаНаОтгрузку.Товары КАК Лико_ЗаявкаНаОтгрузкуТовары
		|		ПО ВТ_СДатойПоследнейЗаявки.Характеристика = Лико_ЗаявкаНаОтгрузкуТовары.Характеристика
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_СДатойПоследнейЗаявки.Намотка = Лико_ЗаявкаНаОтгрузкуТовары.Намотка
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_СДатойПоследнейЗаявки.КодЭтикеткиЗаказчика = Лико_ЗаявкаНаОтгрузкуТовары.КодЭтикеткиЗаказчика
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_СДатойПоследнейЗаявки.НомерПоставки = Лико_ЗаявкаНаОтгрузкуТовары.НомерПоставки
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_СДатойПоследнейЗаявки.Город = Лико_ЗаявкаНаОтгрузкуТовары.Город
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &БезКлючевыхПараметров
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВТ_СДатойПоследнейЗаявки.ЧестныйЗнак = Лико_ЗаявкаНаОтгрузкуТовары.ЧестныйЗнак
		|			КОНЕЦ)
		|			И ((ВЫРАЗИТЬ(Лико_ЗаявкаНаОтгрузкуТовары.Примечание КАК СТРОКА(10))) <> """")
		|			И ВТ_СДатойПоследнейЗаявки.ДатаПоследнейЗаявкиНаОтгрузку = Лико_ЗаявкаНаОтгрузкуТовары.Ссылка.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СДатойПоследнейЗаявки.НомерСтроки,
		|	ВТ_СДатойПоследнейЗаявки.Характеристика,
		|	ВТ_СДатойПоследнейЗаявки.Намотка,
		|	ВТ_СДатойПоследнейЗаявки.КодЭтикеткиЗаказчика,
		|	ВТ_СДатойПоследнейЗаявки.НомерПоставки,
		|	ВТ_СДатойПоследнейЗаявки.Город,
		|	ВТ_СДатойПоследнейЗаявки.ЧестныйЗнак,
		|	ВТ_СДатойПоследнейЗаявки.ДатаПоследнейЗаявкиНаОтгрузку";

	Запрос.УстановитьПараметр("ТаблицаРастарки", ТаблицаРастарки);
	Запрос.УстановитьПараметр("ДатаРастарки", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("БезКлючевыхПараметров", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Попробуем поискать без ключевых параметров
		Запрос.УстановитьПараметр("БезКлючевыхПараметров", Истина);
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
	
	ОбработанныеНомераЦепочек = Новый Массив;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаРастарки = Объект.ЗаказыНаРастарку[Выборка.НомерСтроки - 1]; 
			Если ОбработанныеНомераЦепочек.Найти(СтрокаРастарки.НомерЦепочки) = Неопределено Тогда
				СтрокаРастарки.Примечание = Выборка.Примечание;
				Сообщить("Заполнено примечание из заявки на отгрузку №" + Выборка.НомерЗаявкиНаОтгрузку + " для цепочки №" + СтрокаРастарки.НомерЦепочки + ?(Запрос.Параметры.БезКлючевыхПараметров, " (без ключевых параметров, необходима проверка)", ""));
				// Заполмним номер цепочки, чтобы заполнить примечание только в первой из неисходных строк
				ОбработанныеНомераЦепочек.Добавить(СтрокаРастарки.НомерЦепочки);
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
